/*
   Не ме цитирайте, но всички скоби, препинателни знаци, равнота, цифри,
   празни места, изобщо всичко друго освен буквите *не е* латиница. От това
   разбира се, следва че всяа програма на Go, за която мога да се сетя, съдържа
   символи, които не са на латиница. Съответно най - точната имплементация ще е
   едно "return false" и нищо друго. Въпреки това съм написал функция за това,
   което сте си мислили, че казвате в условието. Но тъй като условието е много
   неясно все още не съм сигурен, че това сте си мислили. Ами неща като
       var lala string = "漢語"
   Тук нелатинските йероглифи са сигурно затворени в низ. Но от слайдовете и условието
   оставам с впечатление, че се интересувате от имената в програмата. Дали е така?
   Въпроси... въпроси...
   Избрах си най - простия вариант.
*/

package challenge1

func hasOnlyLatinSymbols(input string) bool {
	for _, symbol := range input {
		if symbol >= 127 {
			return false
		}
	}
	return true
}
